tests/cases/viscoelasticTransport/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Manufactured stress-gradient impulse: walls are stationary;
    tau_xy = 1e8*y initially and the interior velocity starts at zero.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 -1 -2 0 0 0 0];
internalField nonuniform List<symmTensor>
80
(
(0 2500.0 0 0 0 0)
(0 2500.0 0 0 0 0)
(0 2500.0 0 0 0 0)
(0 2500.0 0 0 0 0)
(0 7500.0 0 0 0 0)
(0 7500.0 0 0 0 0)
(0 7500.0 0 0 0 0)
(0 7500.0 0 0 0 0)
...
);
boundaryField {
#includeEtc "caseDicts/setConstraintTypes"
bottom {type zeroGradient;}
top {type zeroGradient;}
left {type cyclic;}
right {type cyclic;}
}
